#Использовать ".."

Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_ПроверитьСозданиеРабочегоПространства");

	Возврат ВсеТесты;
	
КонецФункции


Процедура ТестДолжен_ПроверитьСозданиеРабочегоПространства() Экспорт
	Пространство = Новый РабочееПространствоАрхитектора("тесть","создаем");
	Пространство.ПолучитьПредставлениеJSON();
КонецПроцедуры
