#Использовать omygod

Пространство = Новый РабочееПространствоАрхитектора("Привет архитектор", "");

Модель = Пространство.Модель;
НаборПредставлений = Пространство.Представления;

Архитектор = Модель.ДобавитьПерсону("Архитектор", "Системный архитектор");
СистемаАрхитектора = Модель.ДобавитьПрограммнуюСистему(
	"OMyGod","Пакет для проектирования комплектов систем"
);

СистемноеПредставление = НаборПредставлений.СоздатьСистемноеПредставление(
	СистемаАрхитектора,
	"Ынтырпрайз архитектор",
	"Системное представление продукта-системы"
);

СистемноеПредставление.ДобавитьВсеПрограммныеСистемы();
СистемноеПредставление.ДобавитьВсехЛюдей();

Сообщить(Пространство.ПолучитьПредставлениеUMLC4());
Сообщить(Пространство.ПолучитьПредставлениеUML());

Пространство.ЭкспортироватьВоВсеФорматы(
	ОбъединитьПути(ТекущийСценарий().Каталог, "diagrams"),
	"HelloSystem"
);
